In [1]:
import numpy as np
import pandas as pd

path = "data/pro_data.csv"

In [2]:
df = pd.read_csv(path)

In [3]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [4]:
df.tail()

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

In [14]:
# standart Mising falue
df[df.ST_NUM.isna()==True]

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950

In [13]:
#  standart Non Mising Value
df[~(df.NUM_BEDROOMS.isna())]

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [57]:
mising_value = ['na','--','n/a']
df_new = pd.read_csv(path,na_values=mising_value)

In [49]:
df_new.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [25]:
~(df_new.isnull())==True

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0   True    True     True          True          True      True   True
1   True    True     True          True          True      True  False
2   True   False     True          True         False      True   True
3   True    True     True          True          True     False   True
4  False    True     True          True          True      True   True
5   True    True     True          True         False      True   True
6   True   False     True         False          True      True   True
7   True    True     True          True         False      True  False
8   True    True     True          True         False      True   True

In [27]:
df_new.OWN_OCCUPIED.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [58]:
i= 0
for baris in df_new['OWN_OCCUPIED']:
    try:
        int(baris)
        df_new.loc[i,'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    i = i+1

In [30]:
df_new.OWN_OCCUPIED

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [59]:
i = 0
for baris in df_new['NUM_BATH']:
    try:
        float(baris)
    except ValueError:
        df_new.loc[i,'NUM_BATH'] = np.nan
    i = i+1

In [52]:
df_new.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [53]:
df_new.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        2
SQ_FT           2
dtype: int64

In [54]:
val= df_new['ST_NUM'].mean()
val

191.42857142857142

In [60]:
df_new['ST_NUM'].fillna(val,inplace=True)
df_new

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.000000,PUTNAM,Y,3.0,1,1000.0
1,100002000.0,197.000000,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,191.428571,LEXINGTON,N,NaN,1,850.0
3,100004000.0,201.000000,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.000000,BERKELEY,Y,3.0,2,1600.0
5,100006000.0,207.000000,BERKELEY,Y,NaN,1,800.0
6,100007000.0,191.428571,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.000000,TREMONT,Y,NaN,1,NaN
8,100009000.0,215.000000,TREMONT,Y,NaN,2,1800.0

In [61]:
df_new.loc[4,'PID']=100005000.0

In [62]:
df_new

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.000000,PUTNAM,Y,3.0,1,1000.0
1,100002000.0,197.000000,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,191.428571,LEXINGTON,N,NaN,1,850.0
3,100004000.0,201.000000,BERKELEY,NaN,1.0,NaN,700.0
4,100005000.0,203.000000,BERKELEY,Y,3.0,2,1600.0
5,100006000.0,207.000000,BERKELEY,Y,NaN,1,800.0
6,100007000.0,191.428571,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.000000,TREMONT,Y,NaN,1,NaN
8,100009000.0,215.000000,TREMONT,Y,NaN,2,1800.0

In [66]:
mode = df_new['OWN_OCCUPIED'].mode()[0]
mode

'Y'

In [67]:
df_new['OWN_OCCUPIED'].fillna(mode,inplace=True)

In [68]:
df_new

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.000000,PUTNAM,Y,3.0,1,1000.0
1,100002000.0,197.000000,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,191.428571,LEXINGTON,N,NaN,1,850.0
3,100004000.0,201.000000,BERKELEY,Y,1.0,NaN,700.0
4,100005000.0,203.000000,BERKELEY,Y,3.0,2,1600.0
5,100006000.0,207.000000,BERKELEY,Y,NaN,1,800.0
6,100007000.0,191.428571,WASHINGTON,Y,2.0,NaN,950.0
7,100008000.0,213.000000,TREMONT,Y,NaN,1,NaN
8,100009000.0,215.000000,TREMONT,Y,NaN,2,1800.0